In [2]:
testDict = {"name" : "sec", 
            "id" : "300000",
            "address" : "suwon"}
testDict

{'name': 'sec', 'id': '300000', 'address': 'suwon'}

In [5]:
dicList=list(testDict.keys())
dicList

['name', 'id', 'address']

In [ ]:
# 딕셔너리 key value 추가/변경

dic

In [12]:
import pandas as pd
# 딕셔너리가 쓰이는 용도? 컬럼의 이름을 바꿀 떄!!
sellOut = pd.read_csv("./dataset/kopo_region_mst.csv")
sellOut = sellOut.rename(columns={"REGIONID":"AB"})
sellOut

     AB REGIONNAME
0   A00     AFRICA
1   A01    AMERICA
2   A02      KOREA
3   A03     GERMAN
4   A04     BRAZIL
..  ...        ...
68  A68      VENEZ
69  A69    VIETNAM
70  A70     VANUAT
71  A71        NaN
72  A99        ETC

[73 rows x 2 columns]

In [13]:
testDf = pd.read_csv("./dataset/kopo_parameter.csv")

testDf

          PARAM_NAME     PARAM_VALUE
0         VALID_WEEK              20
1   VALID_START_YEAR            2014
2      VALID_PRODUCT        PRODUCT1
3      VALID_PRODUCT        PRODUCT2
4        MA_SECTION1              17
5        MA_SECTION2               9
6     VALID_REGIONID             A01
7     VALID_REGIONID             A02
8    SAVE_TABLE_NAME  CHANNEL_RESULT
9      MA_START_YEAR            2014
10    VALID_END_YEAR            2016
11       MA_END_YEAR            2016